Revit 2020 API
UnitUtils.GetValidUnitTypes Method
 Gets all valid unit types.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2014
Syntax
C#
public static IList<UnitType> GetValidUnitTypes()
Visual Basic
Public Shared Function GetValidUnitTypes As IList(Of UnitType)
Visual C++
public:
static IList<UnitType>^ GetValidUnitTypes()
Return Value
 The valid unit types.
Remarks
 A unit type is considered valid if it is an actual unit type like UT_Length or UT_Angle. Obsolete values and the special values UT_Custom and UT_Undefined are not considered valid.
See Also
UnitUtils Class
Autodesk.Revit.DB Namespace